In [9]:
import pandas as pd
import numpy as np

In [56]:
obj={'student_id':['s1','s2','s3','s4','s5','s6'],
     'stat_score':[55,90,85,71,63,95],
     'math_score':[65,99,87,75,57,88],
     'sex':['Female','Male','Female','Female','Male','Male'],
     'pre_level':['B','A','B','B','C','A']}
df=pd.DataFrame(obj)
df.dtypes

student_id    object
stat_score     int64
math_score     int64
sex           object
pre_level     object
dtype: object

In [31]:
df.groupby(['sex','pre_level'])['stat_score'].mean()

sex     pre_level
Female  B            70.333333
Male    A            92.500000
        C            63.000000
Name: stat_score, dtype: float64

In [32]:
df.describe()

       stat_score  math_score
count    6.000000     6.00000
mean    76.500000    78.50000
std     15.946787    15.74484
min     55.000000    57.00000
25%     65.000000    67.50000
50%     78.000000    81.00000
75%     88.750000    87.75000
max     95.000000    99.00000

In [33]:
df.groupby('sex', as_index=False)['stat_score'].agg([np.mean,sum])

      sex       mean  sum
0  Female  70.333333  211
1    Male  82.666667  248

In [34]:
df.groupby('sex', as_index=False).agg({'stat_score':np.mean, 'math_score':sum})

      sex  stat_score  math_score
0  Female   70.333333         227
1    Male   82.666667         244

In [37]:
df.groupby('sex', as_index=False).agg({'stat_score':[np.mean,np.median], 'math_score':[sum,max]})

      sex stat_score        math_score
                mean median        sum max
0  Female  70.333333   71.0        227  87
1    Male  82.666667   90.0        244  99

In [53]:
df=pd.read_csv('./data/gapminder.tsv', sep='\t')
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [55]:
avg_life_exp_by_year=df.groupby('year')[['lifeExp','gdpPercap']].mean()
avg_life_exp_by_year

        lifeExp     gdpPercap
year
1952  49.057620   3725.276046
1957  51.507401   4299.408345
1962  53.609249   4725.812342
1967  55.678290   5483.653047
1972  57.647386   6770.082815
1977  59.570157   7313.166421
1982  61.533197   7518.901673
1987  63.212613   7900.920218
1992  64.160338   8158.608521
1997  65.014676   9090.175363
2002  65.694923   9917.848365
2007  67.007423  11680.071820

In [42]:
years=df.year.unique()
years

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [43]:
y1952=df.loc[df.year==1952]
y1952.head()

        country continent  year  lifeExp       pop    gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333   779.445314
12      Albania    Europe  1952   55.230   1282697  1601.056136
24      Algeria    Africa  1952   43.077   9279525  2449.008185
36       Angola    Africa  1952   30.015   4232095  3520.610273
48    Argentina  Americas  1952   62.485  17876956  5911.315053

In [44]:
y1952_mean=y1952.lifeExp.mean()
y1952_mean

49.057619718309866

In [54]:
con_le_agg=df.groupby('continent')[['lifeExp','pop']].agg(np.mean)
print(con_le_agg)

             lifeExp           pop
continent
Africa     48.865330  9.916003e+06
Americas   64.658737  2.450479e+07
Asia       60.064903  7.703872e+07
Europe     71.903686  1.716976e+07
Oceania    74.326208  8.874672e+06

In [50]:
df

  student_id  stat_score  math_score     sex pre_level
0         s1          55          65  Female         B
1         s2          90          99    Male         A
2         s3          85          87  Female         B
3         s4          71          75  Female         B
4         s5          63          57    Male         C
5         s6          95          88    Male         A

In [51]:
df['pre_level'].map({'A':0,'B':1,'C':2})

0    1
1    0
2    1
3    1
4    2
5    0
Name: pre_level, dtype: int64

In [52]:
df.sex.map({'Female':'여자','Male':'남자'})

0    여자
1    남자
2    여자
3    여자
4    남자
5    남자
Name: sex, dtype: object

In [62]:
df[['stat_score','math_score']].apply(np.mean)

stat_score    76.5
math_score    78.5
dtype: float64

In [58]:
df[['stat_score','math_score']].sum(axis=1)

0    120
1    189
2    172
3    146
4    120
5    183
dtype: int64

In [72]:
obj={'student_id':['s1','s2','s3','s4','s5','s6'],
     'stat_score':[None,90,85,71,63,None],
     'math_score':[65,None,87,75,57,88],
     'sex':['Female','Male','Female',None,'Male','Male'],
     'pre_level':['B','A','B','B','C',None]}
df1=pd.DataFrame(obj)
df1

  student_id  stat_score  math_score     sex pre_level
0         s1         NaN        65.0  Female         B
1         s2        90.0         NaN    Male         A
2         s3        85.0        87.0  Female         B
3         s4        71.0        75.0    None         B
4         s5        63.0        57.0    Male         C
5         s6         NaN        88.0    Male      None

In [73]:
df1.isnull()

   student_id  stat_score  math_score    sex  pre_level
0       False        True       False  False      False
1       False       False        True  False      False
2       False       False       False  False      False
3       False       False       False   True      False
4       False       False       False  False      False
5       False        True       False  False       True

In [74]:
df1.isna()

   student_id  stat_score  math_score    sex  pre_level
0       False        True       False  False      False
1       False       False        True  False      False
2       False       False       False  False      False
3       False       False       False   True      False
4       False       False       False  False      False
5       False        True       False  False       True

In [75]:
df1.isna().sum()

student_id    0
stat_score    2
math_score    1
sex           1
pre_level     1
dtype: int64

In [76]:
df1.isnull().sum(axis=1)

0    1
1    1
2    0
3    1
4    0
5    2
dtype: int64

In [78]:
df1.dropna()

  student_id  stat_score  math_score     sex pre_level
2         s3        85.0        87.0  Female         B
4         s5        63.0        57.0    Male         C

In [79]:
df1.dropna(axis=1)

  student_id
0         s1
1         s2
2         s3
3         s4
4         s5
5         s6

In [80]:
df1.stat_score.dropna()

1    90.0
2    85.0
3    71.0
4    63.0
Name: stat_score, dtype: float64

In [81]:
df1[['stat_score','math_score']].dropna()

   stat_score  math_score
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0

In [82]:
df2=df1[['stat_score','math_score']].copy()

In [83]:
df2

   stat_score  math_score
0         NaN        65.0
1        90.0         NaN
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0
5         NaN        88.0

In [84]:
df2.fillna(0)

   stat_score  math_score
0         0.0        65.0
1        90.0         0.0
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0
5         0.0        88.0

In [85]:
df2.fillna(df2.mean())

   stat_score  math_score
0       77.25        65.0
1       90.00        74.4
2       85.00        87.0
3       71.00        75.0
4       63.00        57.0
5       77.25        88.0

In [86]:
df=pd.read_csv('data/data/data/예제/University_date.csv', encoding='CP949')
df

      대학이름         창립일
0    서울대학교  1946-10-15
1    KAIST  1971-02-16
2    UNIST  2007-09-03
3  포항공과대학교  1986-12-03
4    고려대학교  1905-05-05
5     GIST  1993-11-17
6    건국대학교  1946-05-15
7    울산대학교  1969-12-24
8    부산대학교  1946-05-15

In [90]:
df['창립일'].dtype

dtype('O')

In [91]:
pd.to_datetime(df['창립일'])

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [97]:
pd.to_datetime(df['창립일'], format='%Y-%m-%d')

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [98]:
df['창립일']=pd.to_datetime(df['창립일'])

In [100]:
df['창립일']

0   1946-10-15
1   1971-02-16
2   2007-09-03
3   1986-12-03
4   1905-05-05
5   1993-11-17
6   1946-05-15
7   1969-12-24
8   1946-05-15
Name: 창립일, dtype: datetime64[ns]

In [101]:
pd.date_range('2024-01-01','2024-01-30')

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10', '2024-01-11', '2024-01-12',
               '2024-01-13', '2024-01-14', '2024-01-15', '2024-01-16',
               '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20',
               '2024-01-21', '2024-01-22', '2024-01-23', '2024-01-24',
               '2024-01-25', '2024-01-26', '2024-01-27', '2024-01-28',
               '2024-01-29', '2024-01-30'],
              dtype='datetime64[ns]', freq='D')

In [107]:
pd.date_range('2020-01-01', periods=5, freq='m')

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31'],
              dtype='datetime64[ns]', freq='M')

In [114]:
df['창립일'].dt.daysinmonth

0    31
1    28
2    30
3    31
4    31
5    30
6    31
7    31
8    31
Name: 창립일, dtype: int32